Autodesk.Revit.DB.Structure.RebarHookType.CreateDefaultRebarHookType(Autodesk.Revit.DB.Document)
Creates a new RebarHookType object with a default name.
ADoc:
The document.
Returns:
The newly created type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Structure.RebarHookType.GetHookExtensionLength(Autodesk.Revit.DB.Structure.RebarBarType)
Computes the hook extension length based on current hook length
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.RebarHookType.Create(Autodesk.Revit.DB.Document,System.Double,System.Double)
Creates a new RebarHookType in a document.
angle:
Determine the hook angle of new RebarHookType.
multiplier:
Determine the straight line multiplier of new RebarHookType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not a number
-or-
The given value for multiplier is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
angle must be greater than 0 and no more than pi.
-or-
multiplier must be greater than 0 and no more than 99.